data:
    Customer_name,Customer_id,New_Customer_id,updated_date

Oliver,213,512,2018-06-12
Oliver,512,342,2018-09-01
Oliver,342,513,2019-03-06
Ethan,413,414,2019-05-04
Ethan,414,416,2019-09-02
Abigail,326,327,2017-02-13
Abigail,327,348,2018-05-23
Abigail,348,544,2019-09-27
Abigail,544,566,2020-04-09

# Importing necessary librabries

In [1]:
import numpy as np 
import pandas as pd

# converting it into dataframe

In [2]:
data = {'Customer_name':['Oliver','Oliver','Oliver','Ethan','Ethan','Abigail','Abigail','Abigail','Abigail'],
         'Customer_id': [213, 512, 342, 413, 414, 326, 327, 348, 544],
    'New_Customer_id': [512, 342, 513, 414, 416, 327, 348, 544, 566],
       'updated_date': ['2018-06-12', '2018-09-01', '2019-03-06', '2019-05-04', '2019-09-02', '2017-02-13', '2018-05-23', '2019-09-27', '2020-04-09']}

In [3]:
customer = pd.DataFrame(data)

In [4]:
customer

  Customer_name  Customer_id  New_Customer_id updated_date
0        Oliver          213              512   2018-06-12
1        Oliver          512              342   2018-09-01
2        Oliver          342              513   2019-03-06
3         Ethan          413              414   2019-05-04
4         Ethan          414              416   2019-09-02
5       Abigail          326              327   2017-02-13
6       Abigail          327              348   2018-05-23
7       Abigail          348              544   2019-09-27
8       Abigail          544              566   2020-04-09

In [5]:
customer['updated_date'] = pd.to_datetime(customer['updated_date'])

In [6]:
# sorting the values of cutomer_name and updated_date into decsneding order 
customer.sort_values(by = ['Customer_name','updated_date'],ascending = [True,False],inplace = True)

In [7]:
#overlooking the values are sorted or not
customer

  Customer_name  Customer_id  New_Customer_id updated_date
8       Abigail          544              566   2020-04-09
7       Abigail          348              544   2019-09-27
6       Abigail          327              348   2018-05-23
5       Abigail          326              327   2017-02-13
4         Ethan          414              416   2019-09-02
3         Ethan          413              414   2019-05-04
2        Oliver          342              513   2019-03-06
1        Oliver          512              342   2018-09-01
0        Oliver          213              512   2018-06-12

In [8]:
#taking the value of first i.e max of date
latest_new_customer_id = customer.groupby('Customer_name').first()['New_Customer_id']

In [9]:
latest_new_customer_id

Customer_name
Abigail    566
Ethan      416
Oliver     513
Name: New_Customer_id, dtype: int64

# result

In [10]:
for customer_name,new_customer_id in latest_new_customer_id.items():
    print(f'latest new customer ID for {customer_name}: {new_customer_id}')

latest new customer ID for Abigail: 566
latest new customer ID for Ethan: 416
latest new customer ID for Oliver: 513

In [11]:
#thank you